from Bot import *

text_Hi = "Привет, {0.first_name}! Мы рады поприветствовать тебя в нашем весёлом и позновательном чате Московского зоопарка! Сегодня\
 ты сможешь узнать много интнресного о жителях нашего зоопарка, а также о том, как стать для них лучшим другом!\
  Для этого мы открыли специальный клуб Друзей, и далее ты сможеш узать о нем поподробнее и пройти тест, который\
   подскажет, кто же из наших чудесных обитателей станет тебе идеальным другом?"

text_friends_club = "Возьмите животное под опеку!\nУчастие в программе «Клуб друзей зоопарка» — это помощь \
в содержании наших обитателей, а также ваш личный вклад в дело сохранения биоразнообразия Земли и развитие нашего \
зоопарка.\nОсновная задача Московского зоопарка с самого начала его существования это — сохранение биоразнообразия \
планеты. Когда вы берете под опеку животное, вы помогаете нам в этом благородном деле. При нынешних темпах развития \
цивилизации к 2050 году с лица Земли могут исчезнуть около 10 000 биологических видов. Московский зоопарк вместе с \
другими зоопарками мира делает все возможное, чтобы сохранить их.\nТрадиция опекать животных в Московском зоопарке \
возникло с момента его создания в 1864г. Такая практика есть и в других зоопарках по всему миру.\nВ настоящее время \
опекуны объединились в неформальное сообщество — Клуб друзей Московского зоопарка. Программа «Клуб друзей» дает \
возможность опекунам ощутить свою причастность к делу сохранения природы, участвовать в жизни Московского зоопарка и \
его обитателей, видеть конкретные результаты своей деятельности.\nОпекать – значит помогать любимым животным. Можно \
взять под крыло любого обитателя Московского зоопарка, в том числе и того, кто живет за городом – в Центре \
воспроизводства редких видов животных под Волоколамском. Там живут и размножаются виды, которых нет в городской части \
зоопарка: величественные журавли стерхи, забавные дрофы, исчезнувшая в природе лошадь Пржевальского, изящные антилопы \
бонго и многие другие. Можете съездить на экскурсию в Центр и познакомиться с обитателями.\nСтать опекуном очень \
просто!\n1)Выберите животное, которое Вы хотели бы опекать\n2)Определите сумму пожертвования\n3)Затем мы с Вами \
согласуем договор\n4)Готово! Ждем Вас в гости, чтобы подписать договор и передать Вам Вашу карту опекуна! Переходите \
на сайт чтобы стать опекуном!"


text_start_test = ("Итак! Ты готов узнать с каким животным из нашего зоопарка ты обязательно найдеш общий язык? Ответь \
на несколько вопросов и встречай своего будущего друга! Если захочеш пройти тест еще раз нажми на кномку \
[попробовать снова] или кнопку [вернуться], которая отправит тебя в главное меню.")


text_to_site = ("Ждем вас на сайте! https://moscowzoo.ru/")


text_connect =("Свяаться с сотрудником можно по этой ссылке @Tygdhjfjk")

text_dicdic = ('Живущая в густом кустарнике крошечная антилопа с огромными глазами и хоботком. \
Дикдик Кирка - один из четырёх видов антилоп дикдик. Считается, что вид имеет 6 подвидов и, возможно, \
седьмой подвид, обитающий на юго-западе Африки.Обыкновенный дикдик по международному статусу относится к видам, \
существование которых вызывает наименьшее опасение.')

text_walrus = 'Морж — вид морских млекопитающих, единственный современный вид в семействе моржовых парвотряда \
ластоногих.Моржи являются относительно долгоживущими социальными животными и считаются "ключевым видом" в \
морских регионах Арктики.'

text_seal = ('Уникальные особенности строения позволяют северному морскому котику стремительно двигаться в воде и \
быстро перемещаться по суше; хорошо видеть, как в воздушной среде, так и под водой и месяцами не выходить на берег. \
вид включён в Международную Красную Книгу в статусе уязвимого. Численность животных продолжает сокращаться.')

text_alpaca = 'Одомашненный потомок дикого безгорбого верблюда Южной Америки.Д омашнее животное, в диком виде \
не встречается.'

text_papuan = 'После императорского и королевского, папуанский пингвин – самый крупный представитель семейства. Один \
из трех видов, относящихся к роду антарктических пингвинов. Иногда специалисты орнитологи выделяют 2 подвида \
папуанского пингвина P.p. ellsworthi и P.p. papua. Особи первого подвида мельче, у них более длинные перья, короче \
крылья и клюв и меньше лапы.'

text_snow_leopard = 'Ирбис – очень редкая кошка, вид находится в уязвимом состоянии. Включён в 1 Приложение \
Конвенции о международной торговле редкими вида дикой фауны и флоры, находящимися под угрозой исчезновения.'

text_cougar = 'Кошка, живущая и в Северном, и в Южном полушариях. Обитает на землях многих индейских племён и поэтому \
имеет массу местных названий.Пума включена в Международную Красную книгу как вид, чьё существование вызывает \
наименьшее опасение.'

text_hedgehog = 'Белогрудый ёж, или белобрюхий ёж (лат. Erinaceus concolor), — млекопитающее рода евразийских ежей \
семейства ежовых. В отличие от западноевропейского, белогрудый ёж сам не роет норы, а использует для жилья корневища, \
гнилые пни, кучи листвы и другие подобные места. Зимует, впадая в спячку, иногда в заброшенных норах других животных. \
Например, в Болгарии спячка, как правило, длится с октября–ноября по март–апрель.'

text_owl = 'Очаровательная маленькая сова с очень большой головой и густо оперёнными ногами.По международному статусу \
мохноногий сыч относится к видам, состояние которых не вызывает опасений.'

text_humboldt = 'Небольшой пингвин, которого можно узнать по розовой полосе вокруг клюва. Своё название птица получила \
в честь известного немецкого географа и путешественника начала 19 века Александра Гумбольдта.Вид находится на грани \
исчезновения, внесен в Международную Красную книгу – IUCN (VU), и Конвенцию о международной торговле видами дикой \
фауны и флоры – CITES I. Мировая популяция насчитывает 12 000 пар, из которых 8 000 гнездится в Чили, а 4 000 – в \
Перу. Вид достаточно уязвимый: так, мощная фаза Эль Ниньо в 1982-1983 гг. препятствовала поднятию холодных вод из \
глубин океана, богатых кислородом, что привело к гибели рыбы и потере 65% популяции пингвина.'

text_bat = 'Единственный из многих видов крыланов, способный к эхолокации.В отряде рукокрылых два подотряда – летучие \
мыши и крыланы. Летучие мыши с помощью эхолокации прекрасно ориентируются в полной темноте и охотятся на насекомых. \
Крыланы питаются фруктами, и способностью к эхолокации обладает только тот вид, представители которого ночуют в \
пещерах – это нильские крыланы.Нильские крыланы относятся к видам, находящимся под наименьшей угрозой исчезновения.'

text_fenech = 'По мнению некоторых зоологов, фенека следует относить не к роду лисиц, от которых он отличается по \
целому ряду признаков, а к отдельному роду — Fennecus. У фенека 32 пары хромосом, в то время как у других видов \
лисиц их 35–39, и во многом отличное от остальных лис поведение.Точная численность фенеков неизвестна, однако, по \
всей видимости, она сокращается'

text_leo = 'Льва называют царём зверей. Он и вправду ведёт царскую жизнь – основными добытчиками в прайде являются \
львицы, однако первым к еде приступает самец.Львы взяты под охрану Международным союзом охраны природы, а азиатский \
подвид занесён в Красную книгу как находящийся под угрозой исчезновения, в настоящее время в дикой природе осталось \
не больше 200 этих животных.'

text_meerkat = 'Эти животные немного похожи на обезьян, немного на енотов, и чуть-чуть на грызунов. В \
действительности, они хищники и ближайшие родственники мангустов. Живя в суровых условиях Калахари, сурикаты питаются \
животными, яд которых убивает человека наповал.В некоторых местах ареала вид обычен, хотя численность в связи с \
нарушением среды обитания сокращается. Дальнейшее вмешательство человека в природу может стать причиной ухудшения \
ситуации.'

text_panda = 'Симпатичный зверь размером с крупного домашнего кота, малая панда полосатым хвостом похожа на енота. \
За яркую шерсть её называют «огненной лисой», а за повадки – «кошачьим медведем». Последние генетические исследования \
позволили выделить малую панду в отдельное семейство – пандовые.Малая панда включена в списки Международной Красной \
книги со статусом «подвергающийся опасности.'

text_badger = 'Медоед известен своим бесстрашием при совсем небольших размерах. Своё название зверёк получил за то, \
что часто разоряет пчелиные ульи, лакомясь мёдом и личинками пчёл. Существование в природе не вызывает опасений. \
Однако в некоторых регионах, в том числе, Южной Африке, популяция сокращается. '

text_python = 'Тёмный тигровый питон (лат. Python bivittatus) — очень крупная неядовитая змея семейства питонов. \
Описание. Внешний вид. В природе может достигать в длину более 4 метров, но обычно встречаются особи длиной около \
3,7 метра.'

text_dennessy = 'Исполинский веслоног (лат. Rhacophorus dennysi) — вид бесхвостых земноводных из семейства \
веслоногих лягушек. Общая длина достигает 10—11 см. По строению похож на других представителей своего рода. Окраска \
спины зелёная с маленькими чёрно-бурыми пятнами с узкой жёлтой каймой, напоминает листья, пораженные грибковой \
болезнью. Брюхо беловатое. Любит тропические и субтропические влажные леса, реки, озёра, болота, пруды.'

text_elephant = 'Азиатский слон в значительно большей степени, чем африканский, лесной житель. При этом он п\
редпочитает светлые леса с густым подлеском из кустарников и особенно бамбука. Летом слоны поднимаются довольно \
высоко в горы по лесистым склонам, и в Гималаях они встречаются у границы вечных снегов. В настоящее время дикие \
азиатские слоны находятся под угрозой исчезновения.'

text_camel = 'Самый крупный представитель подотряда мозоленогих.Дикий двугорбый верблюд – очень редкое животное, \
занесено в Красную книгу МСОП, в категории CR – вид, находящийся в критической опасности угрозы исчезновения. \
Популяция этих животных насчитывает лишь несколько сотен особей. По некоторым данным, дикий верблюд по степени угрозы \
находится на восьмом месте среди млекопитающих, стоящих на грани исчезновения.'

text_capybara = 'Внешне капибара напоминает морскую свинку, только очень большую.Капибара — флегматичный добродушный \
вегетарианец, лишённый ярких индивидуальных черт, присущих некоторым его сородичам, но этот недостаток восполняется у \
нее спокойным и дружелюбным нравом. Обычный вид, не относится к охраняемым.'

text_giraffe = ('Парнокопытное млекопитающее из семейства жирафовых. Является самым высоким наземным животным планеты. \
Жирафы обитают в саваннах Африки. Сегодня их можно встретить только к югу и юго-востоку от Сахары, прежде всего в \
саваннах Восточной и Южной Африки.В дикой природе продолжительность жизни жирафа составляет около 25 лет, в неволе — \
около 35 лет.')